/**
 * 正则常用类，提供常用的正则对象
 * */
export class RegExpPattern {
}
/**
 * 银行卡正则
 * @private 银行卡
 */
RegExpPattern.BANK_CARD = /^([1-9]{1})(\d{15}|\d{18})$/;
/**
 * 手机号正则
 * @private
 */
RegExpPattern.PHONE = /^1((3[\d])|(4[5,6,7,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[1,8,9]))\d{8}$/;
/**
 * email正则
 */
RegExpPattern.EMAIL = /^[a-zA-Z0-9.!#$%&'*+\/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
/**
 * 身份证正则
 * @private
 */
RegExpPattern.ID = /(^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$)|(^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$)/;
/**
 * 座机电话
 * @private
 */
RegExpPattern.LANDLINE_TELEPHONE = /\d{3}-\d{8}|\d{4}-\d{7}/;
/**
 * 数字正则
 * @private
 */
RegExpPattern.NUMBER = /^\d{1,}$/;
/**
 * qq正则
 * @private
 */
RegExpPattern.QQ = /^[1-9][0-9]{4,10}$/;
/**
 * 小数正则
 */
RegExpPattern.DECIMAL = /^\d+\.\d+$/;
/**
 * 汉字正则
 */
RegExpPattern.CHINESE_CHARACTERS = /^[\u4E00-\u9FA5]+$/;
/**
 * 英文字母正则
 */
RegExpPattern.ENGLISH = /^[a-zA-Z]+$/;
/**
 * 小写英文正则
 */
RegExpPattern.LOWER_ENGLISH = /^[a-z]+$/;
/**
 * 大写英文正则
 */
RegExpPattern.CAPITALIZE_ENGLISH = /^[A-Z]+$/;
/**
 * IPV4正则
 */
RegExpPattern.IPV4 = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/;
/**
 * IPV6正则
 */
RegExpPattern.IPV6 = /^((([0-9A-Fa-f]{1,4}:){7}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}:[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){5}:([0-9A-Fa-f]{1,4}:)?[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){4}:([0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){3}:([0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){2}:([0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){6}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(([0-9A-Fa-f]{1,4}:){0,5}:((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|(::([0-9A-Fa-f]{1,4}:){0,5}((\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b)\.){3}(\b((25[0-5])|(1\d{2})|(2[0-4]\d)|(\d{1,2}))\b))|([0-9A-Fa-f]{1,4}::([0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})|(::([0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})|(([0-9A-Fa-f]{1,4}:){1,7}:))$/i;
/**
 * 颜色正则
 */
RegExpPattern.COLOR = /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/;
/**
 * 邮政编码正则
 */
RegExpPattern.POSTAL_CODE = /^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/;
